scr1c/Documents/ЗаявкиНаРегистрацию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЗаявкиНаРегистрацию</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>999</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Состояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>емайл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зарегистрирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>имяКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>идКонтрагента</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

scr1c/Enums/Состояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>Состояния</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаРассмотрении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

scr1c/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>емайл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>77</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>999</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяФормированияТокена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ссылкаНаВосстановлениеПароля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>999</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АктивныйДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>333</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доверенность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекБанк</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>333</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаБлокировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогБлокировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

scr1c/Documents/ЗаявкиНаРегистрацию/Forms/ФормаДокумента/Ext/Form/Module.bsl
Функция ПолучитьСписокКАНаСервере()
	
	Стк = Новый Структура("ИНН",Объект.ИНН);
	
	тбл = глОбщий.ДанныеАПИ("KAINN",Стк);
	
	спк = Новый СписокЗначений;
	Для каждого Стр из тбл Цикл
		Спк.Добавить(Стр.идКА,Стр.Наименование);
	КонецЦикла;                                 
	
	Возврат Спк;
	
	
КонецФункции
	
	
&НаКлиенте
Процедура ПолучитьСписокКА()   
	
	Спк = ПолучитьСписокКАНаСервере();
	Если Спк.Количество() = 0 ТОгда
		ПоказатьПредупреждение(,"Контрагент с ИНН "+Объект.ИНН+" в подсистеме Бухгалтерия не найден");
		возврат ;
	КонецесЛИ;  
	
	оо = Новый ОписаниеОповещения("ПослеВыбораИзсписка",ЭтотОбъект);
	ПоказатьВыборИзМеню(оо,спк);
	
КонецПроцедуры   

&НаКлиенте
Процедура ПослеВыбораИзсписка(Рез,Пар) Экспорт
	Если рез = Неопределено Тогда Возврат; КонецеслИ;
	
	Объект.идКонтрагента = рез.Значение;
	Объект.имяКонтрагента = Рез.Представление;
	
	
КонецПроцедуры

	 
&НаКлиенте
Процедура имяКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ПолучитьСписокКА();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	   элементы.Зарегистрировать.Видимость = Объект.Зарегистрирован = Ложь; 
	   Если ОБъект.Зарегистрирован ТОгда
		   ЭтаФорма.ТолькоПросмотр = Истина;
	   КонецесЛИ;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Если Объект.Зарегистрирован = Ложь Тогда Возврат; КонецеслИ;
	
	Если ЗначениеЗаполнено(Объект.идКонтрагента)=Ложь Тогда
		Сообщить("Не заполнен контрагент!");
		отказ = Истина;
	КонецеслИ; 
	
КонецПроцедуры

&НаКлиенте
Процедура Зарегистрировать(Команда)
	// Вставить содержимое обработчика. 
	
	Стк = Новый Структура();
	Стк.Вставить("Код",Объект.ИНН);
	Стк.Вставить("Наименование",Объект.имяКонтрагента);
	Стк.Вставить("емайл",Объект.емайл);
	Стк.Вставить("Телефон",Объект.Телефон);
	Стк.Вставить("КонтактноеЛицо",Объект.КонтактноеЛицо);
	
	
	резЗаписи = Ложь;
	Попытка
		ссКА = ЗаписатьКонтрагента(объект.идКонтрагента,Стк);
		если ссКА = Неопределено ТОгда 
			Сообщить("Уже есть такой контрагент в базе!");
			ВозвраТ;
		Иначе
			объект.Контрагент = ссКА;  
		КонецесЛИ;
		
		объект.Зарегистрирован = Истина;    
		объект.Состояние = ПредопределенноеЗначение("Перечисление.Состояния.Зарегистрирован");
		резЗаписи = ЭтаФорма.Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Проведение));  
		
		ОтправитьСообщениеОРегистрации(ссКА);
		
	исключение   
		Сообщить(ОписаниеОшибки());
	КонецПопытки;   
	
	Если резЗаписи = Ложь Тогда
		объект.Зарегистрирован = Ложь;
	ИНаче
		ЭтаФорма.Закрыть();
	КонецеслИ;
	
	
КонецПроцедуры    

&НаСервереБезКонтекста
Процедура ОтправитьСообщениеОРегистрации(ссКА)
	
	Документы.ЗаявкиНаРегистрацию.ОтправитьСообщениеОРегистрации(ссКА);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаписатьКонтрагента(идКонтрагента,Стк)
	
	сс = Справочники.Контрагенты.ПолучитьСсылку(идКонтрагента);
	Если стрНайти(сокрлП(сс),"не найден")<> 0 Тогда
		Обк = Справочники.Контрагенты.СоздатьЭлемент();
		обк.УстановитьСсылкуНового(сс);  
		ЗаполнитьЗначенияСвойств(Обк,Стк);  
		
		генаПаролей = Новый ГенераторСлучайныхПаролей();
		обк.Пароль = генаПаролей.СлучайныйПароль(8,Ложь);
		обк.записать();  
		сс = обк.ссылка;
	ИНаче
		Возврат Неопределено;
	КонецеслИ;   
	
	Возврат сс;
	
	
КонецФункции
